---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.Get(Autodesk.Revit.DB.Element)
source: html/027830ca-e409-56b8-b72a-c1ed8caa04ac.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.Get Method

Returns an Alignment object given a Revit alignment element.

## Syntax (C#)
```csharp
public static Alignment Get(
	Element alignmentElement
)
```

## Parameters
- **alignmentElement** (`Autodesk.Revit.DB.Element`) - The alignment element.

## Returns
An Alignment for this element, or null if none found.